tutorials/plastic_cases/fracture_wellbore_pressure/with_capillary_pressure/Mis0.99Pc0250Trial3Case/0/Uwetting
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Uwetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    walls
    {
       // type            zeroGradient;

        type            inletOutlet;
        value           $internalField;
        inletValue      uniform (0 0 0);
    }
    walls2
    {
        //type            zeroGradient;
        
	type            inletOutlet;
        value           $internalField;
        inletValue      uniform (0 0 0);
    }

    upperInlet
    {
	type            fixedValue;
        value           uniform (0 0 0);
    }
    lowerInlet
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    rightInlet
    {
	 type            fixedValue;
         value           uniform (0 0 0);
    }
    leftInlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}


// ************************************************************************* //
